_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 146, 146, 32)      2432      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 73, 73, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 69, 69, 32)        25632     
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 34, 34, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 30, 30, 64)        51264     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 15, 15, 64)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 11, 11, 64)        102464    
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 5, 5, 64)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 64)                102464    
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 5)                 325       
=================================================================
Total params: 284,581
Trainable params: 284,581
Non-trainable params: 0
_________________________________________________________________
